dreamted/TRIO_MR_MD/1. TRIO-M/TRIO_M_appl_src_20141204_V5_5_20151207/lib_stm32/src/stm32f10x_adc_0903.c
/*******************************************************************************
* Function Name  : ADC_ExternalTrigInjectedConvCmd
* Description    : Enables or disables the ADCx injected channels conversion
*                  through external trigger
* Input          : - ADCx: where x can be 1 or 2 to select the ADC peripheral.
*                  - NewState: new state of the selected ADC external trigger
*                    start of injected conversion.
*                    This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void ADC_ExternalTrigInjectedConvCmd(ADC_TypeDef* ADCx, u32 NewState)
{
  /* Check the parameters */
  //assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected ADC external event selection for injected group */
    ADCx->CR2.Data |= CR2_JEXTTRIG_Set;
  }
  else
  {
    /* Disable the selected ADC external event selection for injected group */
    ADCx->CR2.Data &= CR2_JEXTTRIG_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_SoftwareStartInjectedConvCmd
* Description    : Enables or disables the selected ADC start of the injected 
*                  channels conversion.
* Input          : - ADCx: where x can be 1 or 2 to select the ADC peripheral.
*                  - NewState: new state of the selected ADC software start
*                    injected conversion.
*                    This parameter can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void ADC_SoftwareStartInjectedConvCmd(ADC_TypeDef* ADCx, u32 NewState)
{
  /* Check the parameters */
  //assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected ADC external event selection for injected group */
    /* Starts the selected ADC injected conversion */
    ADCx->CR2.Data |= CR2_JEXTTRIG_JSWSTRT_Set;
  }
  else
  {
    /* Stops the selected ADC injected conversion */
    /* Disable the selected ADC external event selection for injected group */
	ADCx->CR2.Data &= CR2_JEXTTRIG_JSWSTRT_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_GetSoftwareStartInjectedConvCmdStatus
* Description    : Gets the selected ADC Software start injected conversion Status.
* Input          : - ADCx: where x can be 1 or 2 to select the ADC peripheral.
* Output         : None
* Return         : The new state of ADC software start injected conversion (SET or RESET).
*******************************************************************************/
u32 ADC_GetSoftwareStartInjectedConvCmdStatus(ADC_TypeDef* ADCx)
{
  u32 bitstatus = RESET;

  /* Check the status of JSWSTRT bit */
  if ((ADCx->CR2.Data & CR2_JSWSTRT_Set) != (u32)RESET)
  {
    /* JSWSTRT bit is set */
    bitstatus = SET;
  }
  else
  {
    /* JSWSTRT bit is reset */
    bitstatus = RESET;
  }
  /* Return the JSWSTRT bit status */
  return  bitstatus;
}

/*******************************************************************************
* Function Name  : ADC_InjChannelCfg
* Description    : Configures for the selected ADC injected channel its corresponding
*                  rank in the sequencer and its sample time.
* Input          : - ADCx: where x can be 1 or 2 to select the ADC peripheral.
*                  - ADC_Channel: the ADC channel to configure. 
*                    This parameter can be one of the following values:
*                       - ADC_Channel_0: ADC Channel0 selected
*                       - ADC_Channel_1: ADC Channel1 selected
*                       - ADC_Channel_2: ADC Channel2 selected
*                       - ADC_Channel_3: ADC Channel3 selected
*                       - ADC_Channel_4: ADC Channel4 selected
*                       - ADC_Channel_5: ADC Channel5 selected
*                       - ADC_Channel_6: ADC Channel6 selected
*                       - ADC_Channel_7: ADC Channel7 selected
*                       - ADC_Channel_8: ADC Channel8 selected
*                       - ADC_Channel_9: ADC Channel9 selected
*                       - ADC_Channel_10: ADC Channel10 selected
*                       - ADC_Channel_11: ADC Channel11 selected
*                       - ADC_Channel_12: ADC Channel12 selected
*                       - ADC_Channel_13: ADC Channel13 selected
*                       - ADC_Channel_14: ADC Channel14 selected
*                       - ADC_Channel_15: ADC Channel15 selected
*                       - ADC_Channel_16: ADC Channel16 selected
*                       - ADC_Channel_17: ADC Channel17 selected
*                  - Rank: The rank in the injected group sequencer. This parameter
*                    must be between 1 to 4.
*                  - ADC_SampleTime: The sample time value to be set for the
*                    selected channel. 
*                    This parameter can be one of the following values:
*                       - ADC_SampleTime_1Cycles5: Sample time equal to 1.5 cycles
*                       - ADC_SampleTime_7Cycles5: Sample time equal to 7.5 cycles
*                       - ADC_SampleTime_13Cycles5: Sample time equal to 13.5 cycles
*                       - ADC_SampleTime_28Cycles5: Sample time equal to 28.5 cycles	
*                       - ADC_SampleTime_41Cycles5: Sample time equal to 41.5 cycles	
*                       - ADC_SampleTime_55Cycles5: Sample time equal to 55.5 cycles	
*                       - ADC_SampleTime_71Cycles5: Sample time equal to 71.5 cycles	
*                       - ADC_SampleTime_239Cycles5: Sample time equal to 239.5 cycles	
* Output         : None
* Return         : None
*******************************************************************************/
void ADC_InjChannelCfg(ADC_TypeDef* ADCx, u32 ADC_Channel, u32 Rank, u32 ADC_SampleTime)
{
	switch(ADC_Channel)
	{
		case ADC_Channel_0:  ADCx->SMPR2.SMP0  = ADC_SampleTime; break;
		case ADC_Channel_1:  ADCx->SMPR2.SMP1  = ADC_SampleTime; break;
		case ADC_Channel_2:  ADCx->SMPR2.SMP2  = ADC_SampleTime; break;
		case ADC_Channel_3:  ADCx->SMPR2.SMP3  = ADC_SampleTime; break;
		case ADC_Channel_4:  ADCx->SMPR2.SMP4  = ADC_SampleTime; break;
		case ADC_Channel_5:  ADCx->SMPR2.SMP5  = ADC_SampleTime; break;
		case ADC_Channel_6:  ADCx->SMPR2.SMP6  = ADC_SampleTime; break;
		case ADC_Channel_7:  ADCx->SMPR2.SMP7  = ADC_SampleTime; break;
		case ADC_Channel_8:  ADCx->SMPR2.SMP8  = ADC_SampleTime; break;
		case ADC_Channel_9:  ADCx->SMPR2.SMP9  = ADC_SampleTime; break;
		case ADC_Channel_10: ADCx->SMPR1.SMP10 = ADC_SampleTime; break;
		case ADC_Channel_11: ADCx->SMPR1.SMP11 = ADC_SampleTime; break;
		case ADC_Channel_12: ADCx->SMPR1.SMP12 = ADC_SampleTime; break;
		case ADC_Channel_13: ADCx->SMPR1.SMP13 = ADC_SampleTime; break;
		case ADC_Channel_14: ADCx->SMPR1.SMP14 = ADC_SampleTime; break;
		case ADC_Channel_15: ADCx->SMPR1.SMP15 = ADC_SampleTime; break;
		case ADC_Channel_16: ADCx->SMPR1.SMP16 = ADC_SampleTime; break;
		case ADC_Channel_17: ADCx->SMPR1.SMP17 = ADC_SampleTime; break;
	}

	// Rank configuration
	switch(Rank)
	{
		case 0:	ADCx->JSQR.JSQ1 = ADC_Channel; break;
		case 1: ADCx->JSQR.JSQ2 = ADC_Channel; break;
		case 2: ADCx->JSQR.JSQ2 = ADC_Channel; break;
		case 3: ADCx->JSQR.JSQ2 = ADC_Channel; break;
	}
}

